In [26]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from copy import deepcopy
import time, datetime

In [27]:
og_train_df = pd.read_csv('og_data/train.csv')
og_oil_df = pd.read_csv('og_data/oil.csv')
og_stores_df = pd.read_csv('og_data/stores.csv')
og_transactions_df = pd.read_csv('og_data/transactions.csv')

In [28]:
train_df = deepcopy(og_train_df)
oil_df = deepcopy(og_oil_df)
stores_df = deepcopy(og_stores_df)
transactions_df = deepcopy(og_transactions_df)

In [29]:
og_train_df.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [30]:
og_oil_df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [31]:
og_stores_df.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [32]:
og_transactions_df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [46]:
def GiveUnixTimeListNormalized(vector, date_format="%Y-%m-%d"):
    new_dates = np.zeros(len(vector), dtype=float)
    for i, s in enumerate(vector):
        new_dates[i] = time.mktime(datetime.datetime.strptime(s, date_format).timetuple())
    new_dates -= new_dates.min()
    new_dates /= new_dates.max()
    return new_dates

In [62]:
new_dates = GiveUnixTimeListNormalized(og_transactions_df['date'], date_format="%Y-%m-%d")
transactions_df['date'] = new_dates

In [63]:
transactions_df.head()

       date  store_nbr  transactions
0  0.000000         25           770
1  0.000593          1          2111
2  0.000593          2          2358
3  0.000593          3          3487
4  0.000593          4          1922

In [68]:
stores_transactions_dict = {}
for val in transactions_df['store_nbr'].unique():
    stores_transactions_dict[val] = {}
    stores_transactions_dict[val]['dates'] = transactions_df.where(transactions_df['store_nbr'] == val)['date'].dropna().values.tolist()
    stores_transactions_dict[val]['transactions'] = transactions_df.where(transactions_df['store_nbr'] == val)['transactions'].dropna().values.tolist()

In [84]:
for key in stores_transactions_dict.keys():
    print(key)

25
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
23
24
26
27
28
30
31
32
33
34
35
37
38
39
40
41
43
44
45
46
47
48
49
50
51
54
36
53
20
29
21
42
22
52